<?php
/*
 *  +----------------------------------------------------------------------
 *  | Viswoole [基于swoole开发的高性能快速开发框架]
 *  +----------------------------------------------------------------------
 *  | Copyright (c) 2024 https://viswoole.com All rights reserved.
 *  +----------------------------------------------------------------------
 *  | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
 *  +----------------------------------------------------------------------
 *  | Author: ZhuChongLin <8210856@qq.com>
 *  +----------------------------------------------------------------------
 */

// +----------------------------------------------------------------------
// | 全局中间件定义
// +----------------------------------------------------------------------

declare (strict_types=1);

use App\Middlewares\AllowCrossDomain;
use Viswoole\Core\Facade\Middleware;

// 该中间件用于解决跨域请求问题
Middleware::register(AllowCrossDomain::class);
