<?php
/*
 *  +----------------------------------------------------------------------
 *  | ViSwoole [基于swoole开发的高性能快速开发框架]
 *  +----------------------------------------------------------------------
 *  | Copyright (c) 2024
 *  +----------------------------------------------------------------------
 *  | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
 *  +----------------------------------------------------------------------
 *  | Author: ZhuChongLin <8210856@qq.com>
 *  +----------------------------------------------------------------------
 */

// +----------------------------------------------------------------------
// | 路由配置
// +----------------------------------------------------------------------

declare (strict_types=1);

use ViSwoole\HttpServer\Router\Method;

return [
  // 是否区分大小写
  'case_sensitive' => false,
  // 伪静态后缀，支持通过数组设置多个。
  'suffix' => Method::ANY,
  // 域名校验 例如 www.baidu.com
  'domain' => [],
  // 默认的路由变量正则表达式
  'default_variable_regex' => '[\w\.]+',
  // 路由配置文件列表
  'route_config_files' => [],
];
